Autodesk.Revit.DB.ICloudExternalServer.HasBIM360Accounts
Indicates if the current login user has any BIM 360 accounts or not.
Returns:
Returns true if this ADSK account associated one or more BIM 360 accounts, otherwise returns false.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.CheckFolderPermissionsForSaveAs(System.String,System.String)
check if the folder has permissions for saving as cloud model
projectId:
Project identity in BIM 360.
folderId:
Folder identity in BIM 360.
Returns:
Returns true if the folder has at least "Edit" permission
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.PublishModel(Autodesk.Revit.DB.Document,System.Guid,System.Guid)
pADoc:
Document to publish
projectGuid:
Project Guid of the model to publish
modelGuid:
Model Guid of the model to publish
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.GetProjectInfoFromFolderId(System.String,Autodesk.Revit.CloudExternalData)
folderId:
Folder identity in BIM 360.
data:
Cloud external data as output
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.GetProjectInfoFromHubProjectId(System.String,System.String,System.String,Autodesk.Revit.CloudExternalData)
hubId:
Hub identity in BIM 360.
projectId:
Project identity in BIM 360.
projectName:
Project name.
data:
Cloud external data as output
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer.Execute(Autodesk.Revit.CloudExternalData)
The method that Revit will invoke to get the cloud project information from C4R.
pCloudData:
Contains the input and output data for the execution.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServer
The interface used to get the cloud model information that stored on the cloud (such as C4R).
Remarks:
Implement this interface and register an instance of the derived class with the CloudExternalService.
Since:
2019